Tekla Open API Reference for Tekla Structures 2025
View.ViewMarkTagAttributes.TagAlignment Property
 The tag text alignment.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TextAlignment TagAlignment { get; set; }
Public Property TagAlignment As TextAlignment
	Get
	Set
Property Value
Type: TextAlignment
See Also
Reference
View.ViewMarkTagAttributes Class
Tekla.Structures.Drawing Namespace